clear all;  % 清除各种变量
clc;    %清空输出屏
close all;  %关闭其他窗口
figure(1);  %开始作图1
x1=[0,1, 2, 3, 4 , 5,6,7];  %输入第一条线x坐标数据
y1=[1, 0.77, 0.65, 0.5, 0.36, 0.23,0.15,0.07];  %输入第一条线y坐标数据
plot(x1,y1,'-sr','MarkerSize',10); %利用plot函数画图，x1，y1是横纵坐标'-'是线型，s是标识符形状，r是颜色，
%'MarkerSize',10是指定标识符大小是10
hold on;    %保持住，方便后面的往现有的图上面加
x2=[0,1, 2, 3, 4 , 5,6,7];  %输入第二条线x坐标数据
y2=[1, 0.85, 0.73, 0.67, 0.58, 0.53,0.4,0.3];   %输入第二条线y坐标数据
plot(x2,y2,'-*k');
hold on;
x3=[0,1, 2, 3, 4 , 5,6,7];    %输入第三条线x坐标数据
y3=[1, 0.92, 0.86, 0.8, 0.74, 0.68,0.55,0.45];  %输入第三条线y坐标数据
plot(x3,y3,'-ob');
grid on;    %打开网格
title('示意图')    %图标题
axis([0, 7 ,0 ,1]); %表明x轴范围0-7，y轴范围0-1
set(gca,'YTick',0:0.1:1)    %gca表示当前的图，手动设置y轴刻度0-1间隔为0.1
set(gca,'YTickLabel',{'0','10%','20%','30%','40%','50%','60%','70%','80%','90%','100%'})    
%手动设置标签改为百分比的形式
xlabel('样本');   %横坐标标识
ylabel('识别率');  %纵坐标标识
legend('A模型','B模型','本文模型');    %生成图例
